import React from 'react'
import Nav from './Components/Nav.js'
import Footer from './Components/Footer.js'
import rec1 from '../Images/rec1.jpg'
import './Components/CSSFiles/Recommendation.css'
const recommendations = [
     {qst: "تدابير الوقاية الأساسية من فيروس كورونا ", ans: 'احرص على متابعة آخر المستجدات عن فاشية مرض كوفيد-19، على الموقع الإلكتروني لمنظمة الصحة العالمية ومن خلال سلطات الصحة العامة المحلية والوطنية. وفي حين لا تزال عدوى كوفيد-19 متفشية في الصين بشكل أساسي، فهناك بعض بؤر التفشي في بلدان أخرى.  ومعظم الأفراد الذين يصابون بالعدوى يشعرون بأعراض خفيفة ويتعافون، ولكن الأعراض قد تظهر بشكل أكثر حدة لدى غيرهم. احرص على العناية بصحتك وحماية الآخرين بواسطة التدابير التالية:'},
     {qst: "اغسل اليدين بانتظام ", ans: ' إن تنظيف يديك بالماء والصابون أو فركهما بمطهر كحولي من شأنه أن يقتل الفيروسات التي قد تكون على يديك.'},
     {qst: "احرص على ممارسات النظافة التنفسية", ans: 'احرص على تغطية الفم والأنف بثني المرفق أو بمنديل ورقي عند السعال أو العطس، ثم تخلص من المنديل الورقي فوراً بإلقائه في سلة مهملات مغلقة ونظف يديك بمطهر كحولي أو بالماء والصابون.'},
     {qst: "تجنب الاقتراب كثيرا من الناس", ans: 'احتفظ بمسافة لا تقل عن متر واحدبينك وبين أي شخص يسعل أو يعطس.'},
     {qst: "تجنب لمس عينيك وأنفك وفمك", ans: 'تلمس اليدين العديد من الأسطح ويمكنها أن تلتقط الفيروسات. وإذا تلوثت اليدان فإنهما قد تنقلان الفيروس إلى العينين أو الأنف أو الفم. ويمكن للفيروس أن يدخل الجسم عن طريق هذه المنافذ ويصيبك بالمرض.'},
     {qst: "تابع المستجدات واتبع نصائح مقدمي الرعاية الصحية", ans: 'احرص على متابعة آخر المستجدات بشأن مرض كوفيد-19. واتبع النصائح التي يقدمها لك مقدم الرعاية الصحية وتلك الصادرة عن سلطات الصحة العامة المحلية والوطنية أو عن رب عملك بشأن أساليب حماية نفسك والآخرين من الإصابة بعدوى كوفيد-19.'},
     {qst: "تدابير الحماية للأشخاص الذين يتواجدون في مناطق تنتشر فيها عدوى كوفيد-19 أو زاروها مؤخراً (خلال 14 يوماً الأخيرة)", ans: 'اتّبع الإرشادات الموضحة أعلاه و في حال بدأت تشعر بالتوعك، ولو بأعراض خفيفة كالصداع والحمى المنخفضة الدرجة (37.3 درجة مئوية أو أكثر) ورشح خفيف في الأنف، اعزل نفسك بالبقاء في المنزل حتى تتعافى تماما. وإذا تطلّب الأمر الاستعانة بشخص ما لإحضار ما تحتاج إليه من لوازم أو كنت مضطرا إلى الخروج لشراء ما تأكله مثلا، فارتد قناعا لتجنب نقل العدوى إلى أشخاص آخرين.'}
  ]
function Recommendation () {
             return (
             <div>
                  <Nav/>
                  <div className='Recommendation-style'>
                        <div className='Recommendation-style-part-one' >
                            <img src={rec1} alt="COVID19 Recommendation" /> 
                        </div>
                        <div className='Recommendation-style-part-two'>
                              {recommendations.map(recommendationsItem => 
                                  <div>
                                      <h3>{recommendationsItem.qst}</h3>
                                      <p> {recommendationsItem.ans} </p>
                                  </div> 
                              )}
                        </div>
                  </div>
                  <Footer/>
             </div>
             )
}
export default Recommendation